# Задача 3: Ещё про числа Фибоначчи

## Описание

В данной задачи мы выводим последнюю цифру n-го числа Фибоначчи

### Формат входных данных
- Входные данные находятся в файле inputfib2.txt.
- Первая строка содержит одно число n (0 <= n <= 10^7)

### Формат выходных данных
- В выходном файле outputfib2.txt должна содержаться последняя цифра n-го числа Фибоначчи.

### Ограничения
- Ограничение по времени: 5 сек.
- Ограничение по памяти: 512 Мб.

## Структура проекта
```
lab0/
|-- fib2/
|   |-- src/
|   |   |-- fib2.py
|   |-- txtf/
|   |   |-- inputfib2.txt      # Входные данные
|   |   |-- outputfib2.txt     # Выходные данные
```
## Код задачи
```
import tracemalloc
import time
t_start = time.perf_counter()
tracemalloc.start()
f = open('../txtf/inputfib2.txt')
n = int(f.readline())
f1 = open('../txtf/outputfib2.txt', 'w')
if 0 <= n <= 10**7:
    a, b = 0, 1
    for i in range(2, n + 1):
        a, b = b % 10, (a + b) % 10
    f1.write(str(b))
else:
    print('Не подходит по диапазону, попробуйте ещё раз')
print("Время работы: %s секунд" % (time.perf_counter() - t_start))
print("Затрачено памяти:", tracemalloc.get_traced_memory()[1], "байт")
tracemalloc.stop()

```
## Запуск проекта

1. Перейдите в директорию fib2.
2. Перейдите в директорию txtf.
3. Убедитесь, что файл inputfib2.txt содержит корректные входные данные в указанном формате.
4. Вернитесь в директорию fib2.
5. Перейдите в директорию src.
6. Запустите скрипт:
      python fib2.py
   
7. Результат выполнения будет записан в файл outputfib2.txt в директории txtf.

## Пример

### Входные данные (inputfib.txt)
327305

### Выходные данные (outputfib.txt)
5
