# Задача 1: Множество

## Описание

Этот код выполняет операции над множеством (добавление, удаление и проверка наличия элементов), обрабатывает их на основе данных из файла, записывает результаты в другой файл и выводит информацию о времени выполнения и потреблённой памяти.
- Входные данные находятся в файле input.txt.
- В первой строке входного файла находится строго положительное целое число операций N, не превышающее
5 * 10^5. В каждой из последующих N строк находится одна из следующих операций:
  - A x – добавить элемент x в множество. Если элемент уже есть в множестве, то ничего делать не надо.
  - D x – удалить элемент x. Если элемента x нет, то ничего делать не надо.
  - ? x – если ключ x есть в множестве, выведите «Y», если нет, то выведите «N».
  Аргументы указанных выше операций – целые числа, не превышающие по модулю 10^18.

### Формат выходных данных
- Выводится последовательно результат выполнения всех операций «?».

### Ограничения
- Время выполнения: 2 секунды.
- Память: 256 МБ.

## Структура проекта
```
lab6/
|--   task1/
|     |-- src/
|     |     |-- task1.py      # Реализация алгоритма
|     |-- tests/
|     |     |-- test_task1.py       # Тесты
|     |-- txtf/
|     |     |-- input.txt     # Входные данные
|     |     |-- output.txt    # Выходные данные
```
## Код задачи
```
# Импортируем библиотеки для отслеживания памяти и времени выполнения программы
import tracemalloc
import time
import os
from lab6.utils import open_file, write_file, delete_prev_values, get_output_path, print_output_file

# Запускаем таймер для измерения времени работы программы
t_start = time.perf_counter()

# Включаем отслеживание памяти
tracemalloc.start()

# Устанавливаем пути к файлам
current_dir = os.path.dirname(os.path.abspath(__file__))  # Директория текущего скрипта
txtf_dir = os.path.join(os.path.dirname(current_dir), "txtf")  # Директория с текстовыми файлами
input_path = os.path.join(txtf_dir, "input.txt")

# Функция обработки операций множества
def process_operations(n, operations):
    current_set = set()  # Создаём множество для хранения элементов
    results = []  # Для хранения результатов операций "?"

    for operation in operations:
        cmd, x = operation.split()
        x = int(x)

        if cmd == "A":
            # Добавляем элемент x в множество
            current_set.add(x)
        elif cmd == "D":
            # Удаляем элемент x из множества, если он существует
            current_set.discard(x)
        elif cmd == "?":
            # Проверяем наличие элемента x и записываем результат
            if x in current_set:
                results.append("Y")
            else:
                results.append("N")
    return results

# Основной блок программы
if __name__ == "__main__":
    # Читаем данные из файла input.txt с помощью функции open_file
    data = open_file(input_path)
    n = int(data[0])  # Первая строка содержит количество операций
    operations = data[1:]  # Последующие строки — это операции

    # Проверка корректности входных данных
    if 1 <= n <= 5 * 10**5 and all(op[0] in "AD?" and abs(int(op[2:])) <= 10**18 for op in operations):
        print(f"\nTask: 1\nInput:\n{n}\n{operations}")
        delete_prev_values(1)

        # Обрабатываем операции
        results = process_operations(n, operations)

        # Записываем результаты в файл output.txt
        output_path = get_output_path(1)
        write_file("\n".join(results), output_path)
        print_output_file(1)
    else:
        # Выводим сообщение об ошибке, если данные некорректны
        print('Введите корректные данные')

    # Выводим время работы программы
    print("Время работы: %s секунд" % (time.perf_counter() - t_start))
    # Выводим количество памяти, затраченной на выполнение программы
    print("Затрачено памяти:", tracemalloc.get_traced_memory()[1], "байт")

    # Останавливаем отслеживание памяти
    tracemalloc.stop()


```
## Запуск проекта

1. Перейдите в директорию task1.
2. Перейдите в директорию txtf.
3. Убедитесь, что файл input.txt содержит корректные входные данные в указанном формате.
4. Вернитесь в директорию task1.
5. Перейдите в директорию src.
6. Запустите скрипт:
      python task1.py
   
7. Результат выполнения будет записан в файл output.txt в директории txtf.

## Пример

### Входные данные (input.txt)
```
8
A 2
A 5
A 3
? 2
? 4
A 2
D 2
? 2
```


### Выходные данные (output.txt)
```
Y
N
N
```
