# Задача 4: Построение пирамиды

## Описание

Данный код преобразует массив из файла `input.txt` в `min-heap`, записывает количество перестановок и их список в `output.txt`, а также измеряет время выполнения и затраты памяти программы.
- Входные данные находятся в файле input.txt.
- Первая строка содержит
целое число n (1 ≤ n ≤ 10^5), вторая содержит n целых чисел a_i входного
массива, разделенных пробелом (0 ≤ a_i ≤ 10^9, все a_i - различны.)

### Формат выходных данных
- Первая строка ответа содержит целое число m - количество сделанных свопов. Число m должно
удовлетворять условию 0 ≤ m ≤ 4n. Следующие m строк содержат по 2 числа: индексы i и j сделанной перестановки двух элементов,
индексы считаются с 0. После всех перестановок в нужном порядке мас-
сив должен стать пирамидой.

### Ограничения
- Время выполнения: 3 секунды.
- Память: 512 МБ.

## Структура проекта
```
lab5/
|--   task4/
|     |-- src/
|     |     |-- task4.py      # Реализация алгоритма
|     |-- tests/
|     |     |-- test_task4.py       # Тесты
|     |-- txtf/
|     |     |-- input.txt     # Входные данные
|     |     |-- output.txt    # Выходные данные
```
## Код задачи
```
# Импортируем библиотеки для отслеживания памяти и времени выполнения программы
import tracemalloc
import time
from lab5.utils import *

# Запускаем таймер для измерения времени работы программы
t_start = time.perf_counter()

# Включаем отслеживание памяти
tracemalloc.start()

# Определяем пути к файлам
current_dir = os.path.dirname(os.path.abspath(__file__))  # Текущая директория task1/src
txtf_dir = os.path.join(os.path.dirname(current_dir), "txtf")  # Директория task1/txtf
input_path = os.path.join(txtf_dir, "input.txt")


def build_min_heap(data):
    """Преобразует массив в min-heap и возвращает список свопов"""
    n = len(data)
    swaps = []

    def sift_down(i):
        """Функция просеивания вниз"""
        min_index = i
        left = 2 * i + 1  # индекс левого ребенка
        right = 2 * i + 2  # индекс правого ребенка

        # Если левый ребенок существует и меньше текущего узла
        if left < n and data[left] < data[min_index]:
            min_index = left

        # Если правый ребенок существует и меньше текущего минимального узла
        if right < n and data[right] < data[min_index]:
            min_index = right

        # Если текущий узел не минимальный, обмениваем местами и продолжаем
        if i != min_index:
            swaps.append((i, min_index))  # Запоминаем перестановку
            data[i], data[min_index] = data[min_index], data[i]  # Перестановка
            sift_down(min_index)  # Рекурсивно просеиваем вниз

    # Начинаем обработку с последнего родителя
    for i in range((n - 2) // 2, -1, -1):
        sift_down(i)

    return swaps


# Основной блок программы
if __name__ == "__main__":
    # Читаем данные из файла input.txt с помощью функции open_file
    lines = open_file(input_path)
    n_str = lines[0].strip()  # Убираем пробелы и символы новой строки из первой строки
    m = lines[1].strip().split()  # Разделяем вторую строку на элементы

    n = int(n_str)  # Преобразуем первую строку в число n
    m = list(map(int, m))  # Преобразуем элементы массива в числа

    # Проверка корректности входных данных
    if (1 <= n <= 10 ** 5) and (all(0 <= i <= 10 ** 9 for i in m)):
        print(f"\nTask: 4\nInput:\n{n}\n{m}")
        delete_prev_values(4)

        # Строим min-heap и получаем список перестановок
        swaps = build_min_heap(m)

        output_path = get_output_path(4)
        # Формируем содержимое выходного файла
        output_data = [f"{len(swaps)}"] + [f"{i} {j}" for i, j in swaps]
        write_file("\n".join(output_data), output_path)
        print_output_file(4)
    else:
        # Выводим сообщение об ошибке, если данные некорректны
        print('Введите корректные данные')

    # Выводим время работы программы
    print("Время работы: %s секунд" % (time.perf_counter() - t_start))
    # Выводим количество памяти, затраченной на выполнение программы
    print("Затрачено памяти:", tracemalloc.get_traced_memory()[1], "байт")

    # Останавливаем отслеживание памяти
    tracemalloc.stop()

```
## Запуск проекта

1. Перейдите в директорию task4.
2. Перейдите в директорию txtf.
3. Убедитесь, что файл input.txt содержит корректные входные данные в указанном формате.
4. Вернитесь в директорию task4.
5. Перейдите в директорию src.
6. Запустите скрипт:
      python task4.py
   
7. Результат выполнения будет записан в файл output.txt в директории txtf.

## Пример

### Входные данные (input.txt)
```
5
5 4 3 2 1
```


### Выходные данные (output.txt)
```
3
1 4
0 1
1 3
```
