# Задача 3: Скобочная последовательность. Версия 1

## Описание

Этот код проверяет корректность скобочных последовательностей, считанных из файла, с использованием стека, записывает результаты в выходной файл и выводит информацию о времени работы и затраченной памяти программы.
### Формат входных данных
- Входные данные находятся в файле input.txt.
- Первая строка содержит одно число N (1 ≤ N ≤ 500) — число скобочных последовательностей, которые необходимо проверить.
- Каждая из следующих N строк содержит скобочную последовательность длиной от 1 до 10^4 включительно.

### Формат выходных данных
- Для каждой строки входного файла
(кроме первой, в которой записано число таких строк) выводится в выходной
файл «YES», если соответствующая последовательность является правильной скобочной последовательностью, или «NO», если не является.

### Ограничения
- Время выполнения: 2 секунды.
- Память: 256 МБ.

## Структура проекта
```
lab4/
|--   task3/
|     |-- src/
|     |     |-- task3.py      # Реализация алгоритма
|     |-- tests/
|     |     |-- test_task3.py       # Тесты
|     |-- txtf/
|     |     |-- input.txt     # Входные данные
|     |     |-- output.txt    # Выходные данные
```
## Код задачи
```
# Импортируем библиотеки для отслеживания памяти и времени выполнения программы
import tracemalloc
import time
from lab4.utils import *

# Запускаем таймер для измерения времени работы программы
t_start = time.perf_counter()

# Включаем отслеживание памяти
tracemalloc.start()

current_dir = os.path.dirname(os.path.abspath(__file__))  # Директория task/src
txtf_dir = os.path.join(os.path.dirname(current_dir), "txtf")  # Директория task/txtf
input_path = os.path.join(txtf_dir, "input.txt")


def is_valid_bracket_sequence(sequence):
    """
    Проверяет, является ли скобочная последовательность правильной.
    :param sequence: строка со скобочной последовательностью
    :return: True, если последовательность правильная, иначе False
    """
    stack = []
    matching_brackets = {')': '(', ']': '['}

    for char in sequence:
        if char in "([":  # Если открывающая скобка
            stack.append(char)
        elif char in ")]":  # Если закрывающая скобка
            if stack and stack[-1] == matching_brackets[char]:
                stack.pop()
            else:
                return False  # Если не соответствует, последовательность неправильная
    return not stack  # Если стек пуст, последовательность правильная


# Основной блок программы
if __name__ == "__main__":
    # Читаем данные из файла input.txt с помощью функции open_file
    lines = open_file(input_path)
    n = int(lines[0])  # Количество строк
    sequences = lines[1:]  # Последовательности для проверки

    # Проверка корректности входных данных
    if 1 <= n <= 500 and all(1 <= len(seq) <= 10**4 for seq in sequences):
        print(f"\nTask 3\nInput:\n{n}\n{sequences}")
        delete_prev_values(3)

        # Проверяем каждую последовательность
        results = []
        for seq in sequences:
            results.append("YES" if is_valid_bracket_sequence(seq) else "NO")

        output_path = get_output_path(3)
        # Записываем результаты проверки в файл output.txt
        write_file("\n".join(results), output_path)
        print_output_file(3)
    else:
        # Выводим сообщение об ошибке, если данные некорректны
        print('Введите корректные данные')

    # Выводим время работы программы
    print("Время работы: %s секунд" % (time.perf_counter() - t_start))
    # Выводим количество памяти, затраченной на выполнение программы
    print("Затрачено памяти:", tracemalloc.get_traced_memory()[1], "байт")

    # Останавливаем отслеживание памяти
    tracemalloc.stop()



```
## Запуск проекта

1. Перейдите в директорию task3.
2. Перейдите в директорию txtf.
3. Убедитесь, что файл input.txt содержит корректные входные данные в указанном формате.
4. Вернитесь в директорию task3.
5. Перейдите в директорию src.
6. Запустите скрипт:
      python task3.py
   
7. Результат выполнения будет записан в файл output.txt в директории txtf.

## Пример

### Входные данные (input.txt)
```
5
()()
([])
([)]
((]]
)(
```


### Выходные данные (output.txt)
```
YES
YES
NO
NO
NO
```
