# Задача 2: Сортировка вставками с отслеживанием индексов перемещения

## Описание

В данной задаче реализуется алгоритм сортировки вставками, который не только сортирует массив, но и отслеживает перемещения элементов. Алгоритм сортировки вставками проходит по элементам массива и вставляет каждый элемент в его правильную позицию среди уже отсортированных элементов. При этом алгоритм также возвращает список индексов, показывающий, как менялись позиции элементов в процессе сортировки.

### Формат входных данных
- Входные данные находятся в файле input.txt.
- Первая строка содержит одно число n (1 ≤ n ≤ 1000) — количество элементов в массиве.
- Вторая строка содержит n целых чисел, по модулю не превосходящих 10^9.

### Формат выходных данных
- В выходном файле output.txt должны содержаться две строки:
  1. Первая строка — индексы конечных позиций элементов после сортировки.
  2. Вторая строка — отсортированный массив. Все числа должны быть разделены ровно одним пробелом.

### Ограничения
- Время выполнения: 2 секунды.
- Память: 256 МБ.

## Структура проекта
```
lab1/
|-- task2/
|   |-- src/
|   |   |-- task2.py       # Реализация алгоритма сортировка вставками
|   |-- txtf/
|   |   |-- input.txt      # Входные данные
|   |   |-- output.txt     # Выходные данные
```
## Код задачи
```
import tracemalloc
import time
t_start = time.perf_counter()
tracemalloc.start()
f_input = open('../txtf/input.txt', 'r')
n = int(f_input.readline())
m = [int(x) for x in f_input.readline().split()]
indices = [1]
if (1 <= n <= 10**3) and (all(abs(i) <= 10**9 for i in m)):
    for i in range(1, len(m)):
        key = m[i]
        j = i - 1
        while j >= 0 and m[j] > key:
            m[j + 1] = m[j]
            j -= 1
        m[j + 1] = key
        indices.append(j + 2)
    indices = ' '.join(map(str, indices))
    m_sorted = ' '.join(map(str, m))
    f_output = open('../txtf/output.txt', 'w')
    f_output.write(f'{indices}\n')
    f_output.write(m_sorted)
else:
    print('Введите корректные данные')
print("Время работы: %s секунд" % (time.perf_counter() - t_start))
print("Затрачено памяти:", tracemalloc.get_traced_memory()[1], "байт")
tracemalloc.stop()
```
## Запуск проекта

1. Перейдите в директорию task2.
2. Перейдите в директорию txtf.
3. Убедитесь, что файл input.txt содержит корректные входные данные в указанном формате.
4. Вернитесь в директорию task2.
5. Перейдите в директорию src.
6. Запустите скрипт:
      python task2.py
   
7. Результат выполнения будет записан в файл output.txt в директории txtf.

## Пример

### Входные данные (input.txt)
4
4 3 2 1

### Выходные данные (output.txt)
0 1 2 3
1 2 3 4
