# Задача 5: Индекс Хирша

## Описание

Код подсчитывает индекс Хирша
### Формат входных данных
- Входные данные находятся в файле input.txt.
- Одна строка citations, содержащая n целых чисел, по количеству статей ученого (длина citations), разделённых пробелом или запятой

### Формат выходных данных
- В выходном файле output.txt должно содержаться одно число - индекс Хирша
### Ограничения
- Время выполнения: 2 секунды.
- Память: 256 МБ.

## Структура проекта
```
lab3/
|--   task5/
|     |-- src/
|     |     |-- task5.py      # Реализация алгоритма
|     |-- tests/
|     |     |-- test_task5.py       # Тесты
|     |-- txtf/
|     |     |-- input.txt     # Входные данные
|     |     |-- output.txt    # Выходные данные
```
## Код задачи
```
# Импортируем библиотеки для отслеживания времени работы программы и использования памяти
import tracemalloc
import time
from lab3.utils import open_file, write_file

# Запускаем таймер для измерения времени работы программы
t_start = time.perf_counter()

# Включаем отслеживание памяти, чтобы отслеживать, сколько памяти использует программа
tracemalloc.start()


# Функция для вычисления индекса H (h-index) на основе списка цитирований
def h_index(citations):
    # Сортируем список цитирований по убыванию, чтобы проверить индекс H быстрее
    citations.sort(reverse=True)

    # Проходим по отсортированному списку и находим максимальное значение citations[i],
    # которое выполняет условие citations[i] <= цитированию на позиции i
    for i in range(len(citations)):
        if citations[i] < i + 1:
            return i  # Возвращаем индекс citations[i], если условие нарушено

    # Если все элементы соответствуют условиям, возвращаем длину списка как индекс H
    return len(citations)


# Основной блок программы
if __name__ == "__main__":
    # Читаем данные из файла input.txt с помощью функции open_file
    citations_str = open_file("../txtf/input.txt")
    citations = citations_str[0]

    # Проверка корректности входных данных:
    # - размер массива должен быть в пределах от 1 до 5000
    # - все элементы массива должны быть в пределах от 0 до 1000
    if (1 <= len(citations) <= 5000) and (all(0 <= i <= 1000 for i in citations)):
        # Вычисляем индекс H для списка цитирований
        h_index_value = h_index(citations)

        # Записываем полученное значение индекса H в файл output.txt
        write_file(h_index_value, "../txtf/output.txt")
    else:
        # Если данные некорректны, выводим сообщение об ошибке
        print('Введите корректные данные')

    # Выводим время выполнения программы
    print("Время работы: %s секунд" % (time.perf_counter() - t_start))

    # Выводим количество памяти, затраченной на выполнение программы
    print("Затрачено памяти:", tracemalloc.get_traced_memory()[1], "байт")

    # Останавливаем отслеживание памяти
    tracemalloc.stop()


```
## Запуск проекта

1. Перейдите в директорию task5.
2. Перейдите в директорию txtf.
3. Убедитесь, что файл input.txt содержит корректные входные данные в указанном формате.
4. Вернитесь в директорию task5.
5. Перейдите в директорию src.
6. Запустите скрипт:
      python task5.py
   
7. Результат выполнения будет записан в файл output.txt в директории txtf.

## Пример

### Входные данные (input.txt)
3 0 6 1 5

### Выходные данные (output.txt)
3
