# Задача 6: Сортировка целых чисел

## Описание

Код сортирует массив целых чисел и выводит суммы каждого десятого элемента массива
### Формат входных данных
- Входные данные находятся в файле input.txt.
- Первая строка содержит n,m (1 <= n,m <= 6000)
- Вторая строка содержит n чисел - элементы массива А
- Третья строка содержит m чисел - элементы массива B
### Формат выходных данных
- В выходном файле output.txt должно содержаться одно число - сумма каждого элемента массива
### Ограничения
- Время выполнения: 2 секунды.
- Память: 512 МБ.

## Структура проекта
```
lab3/
|--   task6/
|     |-- src/
|     |     |-- task6.py      # Реализация алгоритма
|     |-- tests/
|     |     |-- test_task6.py       # Тесты
|     |-- txtf/
|     |     |-- input.txt     # Входные данные
|     |     |-- output.txt    # Выходные данные
```
## Код задачи
```
# Импортируем библиотеки для отслеживания памяти и времени выполнения программы
import tracemalloc
import time
from lab3.utils import open_file, write_file

# Запускаем таймер для измерения времени работы программы
t_start = time.perf_counter()

# Включаем отслеживание памяти
tracemalloc.start()


# Генерация массива попарных произведений
def generate_pairwise_array(A, B):
    C = []
    for a in A:
        for b in B:
            C.append(a * b)
    return C


# Основной блок программы
if __name__ == "__main__":
    # Читаем данные из файла input.txt с помощью функции open_file
    n_and_m_str, A, B = open_file("../txtf/input.txt")
    n = int(n_and_m_str[0])
    m = int(n_and_m_str[1])

    # Проверка корректности входных данных
    if (1 <= n, m <= 6000) and (all(0 <= i <= 40000 for i in A)) and all(0 <= i <= 40000 for i in B):
        C = generate_pairwise_array(A, B)
        C.sort()
        # Подсчёт суммы каждого десятого элемента
        result = sum(C[i] for i in range(0, len(C), 10))
        write_file(result, "../txtf/output.txt")
    else:
        # Выводим сообщение об ошибке, если данные некорректны
        print('Введите корректные данные')

    # Выводим время работы программы
    print("Время работы: %s секунд" % (time.perf_counter() - t_start))
    # Выводим количество памяти, затраченной на выполнение программы
    print("Затрачено памяти:", tracemalloc.get_traced_memory()[1], "байт")
    tracemalloc.stop()  # Останавливаем отслеживание памяти



```
## Запуск проекта

1. Перейдите в директорию task6.
2. Перейдите в директорию txtf.
3. Убедитесь, что файл input.txt содержит корректные входные данные в указанном формате.
4. Вернитесь в директорию task6.
5. Перейдите в директорию src.
6. Запустите скрипт:
      python task6.py
   
7. Результат выполнения будет записан в файл output.txt в директории txtf.

## Пример

### Входные данные (input.txt)
4 4
7 1 4 9
2 7 8 11

### Выходные данные (output.txt)
51
