# Задача 3: Сортировка вставками по убыванию

## Описание

В данной задаче реализуется алгоритм сортировки вставками, который сортирует массив по убыванию. Алгоритм проходит по элементам массива и вставляет каждый элемент в его правильную позицию среди уже отсортированных элементов, чтобы обеспечить порядок по убыванию.

### Формат входных данных
- Входные данные находятся в файле input.txt.
- Первая строка содержит одно число n (1 ≤ n ≤ 1000) — количество элементов в массиве.
- Вторая строка содержит n целых чисел, по модулю не превосходящих 10^9.

### Формат выходных данных
- В выходном файле output.txt должен содержаться отсортированный по убыванию массив. Все числа должны быть разделены ровно одним пробелом.

### Ограничения
- Время выполнения: 2 секунды.
- Память: 256 МБ.

## Структура проекта
```
labs/
|-- lab1/
|     |-- task1/
|     |     |-- src/
|     |     |     |-- task3.py      # Реализация алгоритма сортировка вставками
|     |     |-- tests/
|     |     |     |-- test_task3.py       # Тесты
|     |     |-- txtf/
|     |     |     |-- input.txt     # Входные данные
|     |     |     |-- output.txt    # Выходные данные
```
## Код задачи
```
import tracemalloc
import time
from labs.utils import open_file, write_file
t_start = time.perf_counter()
tracemalloc.start()


def descending_sort(n, m):
    for i in range(1, n):
        key = m[i]
        j = i - 1
        while j >= 0 and m[j] < key:
            m[j + 1] = m[j]
            j -= 1
        m[j + 1] = key


if __name__ == "__main__":
    n_str, m = open_file("../txtf/input.txt")
    n = int(n_str)
    if (1 <= n <= 10**3) and (all(abs(i) <= 10**9 for i in m)):
        descending_sort(n, m)
        write_file(" ".join(str(a) for a in m), "../txtf/output.txt")
    else:
        print('Введите корректные данные')
    print("Время работы: %s секунд" % (time.perf_counter() - t_start))
    print("Затрачено памяти:", tracemalloc.get_traced_memory()[1], "байт")
    tracemalloc.stop()
```
## Запуск проекта

1. Перейдите в директорию task3.
2. Перейдите в директорию txtf.
3. Убедитесь, что файл input.txt содержит корректные входные данные в указанном формате.
4. Вернитесь в директорию task3.
5. Перейдите в директорию src.
6. Запустите скрипт:
      python task3.py
   
7. Результат выполнения будет записан в файл output.txt в директории txtf.

## Пример

### Входные данные (input.txt)
6
31 41 59 26 41 58

### Выходные данные (output.txt)
59 58 41 41 31 26
