# Задача 7: Цифровая сортировка

## Описание

Код выводит порядок n строк после k фаз цифровой сортировки
### Формат входных данных
- Входные данные находятся в файле input.txt.
- Первая строка содержит n - число строк, m - их длина и k - число фаз цифровой сортировки (1 <= n <= 10^6, 1 <= k <= m <= 10^6, n * m <= 5 * 10^7)
- Далее находится описание строк, но в нетривиальном формате
### Формат выходных данных
- В выходном файле output.txt должен содержаться новый порядок строк
### Ограничения
- Время выполнения: 3 секунды.
- Память: 256 МБ.

## Структура проекта
```
lab3/
|--   task7/
|     |-- src/
|     |     |-- task7.py      # Реализация алгоритма
|     |-- tests/
|     |     |-- test_task7.py       # Тесты
|     |-- txtf/
|     |     |-- input.txt     # Входные данные
|     |     |-- output.txt    # Выходные данные
```
## Код задачи
```
import tracemalloc
import time
from lab3.utils import open_file, write_file

# Запускаем таймер для измерения времени работы программы
t_start = time.perf_counter()

# Включаем отслеживание памяти
tracemalloc.start()

def radix_sort_phase(strings, phase):
    """Сортировка по заданной фазе (символу)."""
    return sorted(strings, key=lambda x: x[1][phase])

# Основной блок программы
if __name__ == "__main__":
    # Читаем данные из файла input.txt с помощью функции open_file
    (n, m, k), columns = open_file("../txtf/input.txt")

    # Проверка корректности входных данных
    if (1 <= n <= 10**6) and (1 <= k <= m <= 10**6) and (n * m <= 5 * 10**7):
        # Формируем список строк из колонок
        strings = [(i + 1, ''.join(columns[j][i] for j in range(m))) for i in range(n)]

        # Применяем сортировку по фазам
        for phase in range(min(m, k) - 1, -1, -1):
            strings = radix_sort_phase(strings, phase)

        # Подготовка результатов (выводим индексы строк в новом порядке)
        result = [str(item[0]) for item in strings]
        write_file(result, "../txtf/output.txt")
    else:
        print('Введите корректные данные')

    # Выводим время работы программы
    print("Время работы: %s секунд" % (time.perf_counter() - t_start))
    # Выводим количество памяти, затраченной на выполнение программы
    print("Затрачено памяти:", tracemalloc.get_traced_memory()[1], "байт")
    tracemalloc.stop()



```
## Запуск проекта

1. Перейдите в директорию task7.
2. Перейдите в директорию txtf.
3. Убедитесь, что файл input.txt содержит корректные входные данные в указанном формате.
4. Вернитесь в директорию task7.
5. Перейдите в директорию src.
6. Запустите скрипт:
      python task7.py
   
7. Результат выполнения будет записан в файл output.txt в директории txtf.

## Пример

### Входные данные (input.txt)
3 3 3
bab
bba
baa

### Выходные данные (output.txt)
2 3 1
